#include <iostream>
#include <string>     
//using namespace std;

void search_out(int x,int y, int b = 4);

std::string maze[25] = {
"####B######################",
"# #       #   #      #    #",
"# # # ###### #### ####### #",
"# # # #       #   #       #",
"#   # # ######### # ##### #",
"# # # #   #       #     # #",
"### ### ### ############# #",
"# #   #     # #           #",
"# # #   ####### ###########",
"# # # #       # #         C",
"# # ##### ### # # ####### #",
"# # #     ### # #       # #",
"#   ##### ### # ######### #",
"######### ### #           #",
"# ####### ### #############",
"A           #   ###   #   #",
"# ############# ### # # # #",
"# ###       # # ### # # # #",
"# ######### # # ### # # # F",
"#       ### # #     # # # #",
"# ######### # ##### # # # #",
"# #######   #       #   # #",
"# ####### ######### #######",
"#         #########       #",
"#######E############D######"
};

int main()
{
  int x,y;
  std::cin >> y >> x;
  if (x < 0 or x > 25 or y < 0 or maze[x].size() <= y or maze[x][y] != ' ')
  {
    std::cout << "Не верные координаты\n";
  }
  else 
  {
    search_out(x,y);
    std::cout << '\n';
  }
}

void search_out(int x, int y, int b)
{
  int go[4][3] = {{0, 1, 2}, {1, 0, 3}, {0, -1, 0}, {-1, 0, 1}};

  //std::cout << x << ' ' << y << '\n';
  for (int i = 0; i < 4; i++)
  {
    if (i != b)
    {
      int x1 = x+go[i][0], y1 = y+go[i][1], b1 = go[i][2];
      //std::cout << maze[x1][y1] << ' ' << x1 << ' ' << y1 << '\n';
      if (maze[x1][y1] == ' ') search_out(x1,y1,b1);
      else if (maze[x1][y1] != '#') std::cout << maze[x1][y1] << ' ';
    }
    //else std::cout << "b\n";
  }
  //std::cout << "\n";
}
