#include <iostream>

struct Student
{
  char name[100];
  int unsigned group;
  char sec[5];
};

char namedata[100][40] = {
"Ярмолинский Д. Н.","Лукьяненко Н. И.","Хабаров Т. М.","Шульдешова Н. А.","Дорохова Ю. И.","Яковленко В. Е.","Борков А. Е.","Ковалевский А. А.","Кизюрина Е. М.","Дворянкин Н. Т.","Фуриков М. Ф.","Куанышбаев Ф. О.","Турфанов В. М.","Хорошилов Р. М.","Николаевский А. С.","Чазова ﻿. Т.","Крутин А. М.","Ямилова Э. Р.","Коллерова Ф. А.","Бурцов К. С.","Поварницын К. И.","Ямков М. В.","Шурдука С. В.","Кузнецова К. Н.","Дудченко Б. Р.","Домышев К. А.","Суснина А. А.","Котик Б. В.","Козарь А. Е.","Дасаев А. Е.","Ясырев М. Н.","Фунтусова А. Л.","Брюханов В. Л.","Силиванова Р. И.","Доскалиев С. А.","Арнаутова К. А.","Балина В. Б.","Богомазова Э. И.","Барановский О. Э.","Иноземцев А. С."
};

int main()
{
  srand(time(NULL));
  Student stud[10];  
  for (int i = 0;i<10;i++)
  {
    stud[i].group = rand()%8+1;
    for (int j=0;j<5;j++){stud[i].sec[j]=rand()%5+1;}
    int y = rand()%41;
    for (int r=0;r<100;r++)
    {
      stud[i].name[r] = namedata[y][r];
      if (namedata[y][r] == '\0') break;
    }
  }
  bool sudo = true;
  for (int i = 0;i<10;i++)
  {
    bool t = true;
    for (int j=0;j<5;j++)
    {
      if (stud[i].sec[j] < 3){t=true;if (sudo) sudo = false;;break;}
    }
    std::cout << stud[i].name << " " << stud[i].group << '\t';
  }
  if (sudo) std::cout << "Not find";
  std::cout << "\n";
  return 0;
}

